name: "unet"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "aaa"
  transform_param {
    scale: 0.015784123697
  }
  image_data_param {
    source: "/home/yihuihe/Ultrasound-Nerve-Segmentation/data/train.txt"
    batch_size: 32
    is_color: false
    shuffle: false
    new_height: 96
    new_width: 128
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "conv11"
  type: "Convolution"
  bottom: "conv1"
  top: "conv11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu11"
  type: "ReLU"
  bottom: "conv11"
  top: "conv11"
}

layer {
  name: "drop1"
  type: "Dropout"
  bottom: "conv11"
  top: "conv11"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv11"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "conv21"
  type: "Convolution"
  bottom: "conv2"
  top: "conv21"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu21"
  type: "ReLU"
  bottom: "conv21"
  top: "conv21"
}

layer {
  name: "drop2"
  type: "Dropout"
  bottom: "conv21"
  top: "conv21"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv21"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "conv31"
  type: "Convolution"
  bottom: "conv3"
  top: "conv31"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu31"
  type: "ReLU"
  bottom: "conv31"
  top: "conv31"
}

layer {
  name: "drop3"
  type: "Dropout"
  bottom: "conv31"
  top: "conv31"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv31"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv4"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "conv41"
  type: "Convolution"
  bottom: "conv4"
  top: "conv41"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu41"
  type: "ReLU"
  bottom: "conv41"
  top: "conv41"
}

layer {
  name: "drop4"
  type: "Dropout"
  bottom: "conv41"
  top: "conv41"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv41"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}

layer {
  name: "conv51"
  type: "Convolution"
  bottom: "conv5"
  top: "conv51"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2560
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu51"
  type: "ReLU"
  bottom: "conv51"
  top: "conv51"
}

layer {
  name: "up6"
  type: "Deconvolution"
  bottom: "conv51"
  top: "up6"
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat6"
  type: "Concat"
  bottom: "up6"
  bottom: "conv41"
  top: "concat6"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv6"
  type: "Convolution"
  bottom: "concat6"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "conv6"
}

layer {
  name: "conv61"
  type: "Convolution"
  bottom: "conv6"
  top: "conv61"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu61"
  type: "ReLU"
  bottom: "conv61"
  top: "conv61"
}

layer {
  name: "drop6"
  type: "Dropout"
  bottom: "conv61"
  top: "conv61"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "up7"
  type: "Deconvolution"
  bottom: "conv61"
  top: "up7"
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat7"
  type: "Concat"
  bottom: "up7"
  bottom: "conv31"
  top: "concat7"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv7"
  type: "Convolution"
  bottom: "concat7"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "conv7"
}

layer {
  name: "conv71"
  type: "Convolution"
  bottom: "conv7"
  top: "conv71"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu71"
  type: "ReLU"
  bottom: "conv71"
  top: "conv71"
}

layer {
  name: "drop7"
  type: "Dropout"
  bottom: "conv71"
  top: "conv71"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "up8"
  type: "Deconvolution"
  bottom: "conv71"
  top: "up8"
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat8"
  type: "Concat"
  bottom: "up8"
  bottom: "conv21"
  top: "concat8"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv8"
  type: "Convolution"
  bottom: "concat8"
  top: "conv8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv8"
  top: "conv8"
}

layer {
  name: "conv81"
  type: "Convolution"
  bottom: "conv8"
  top: "conv81"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu81"
  type: "ReLU"
  bottom: "conv81"
  top: "conv81"
}

layer {
  name: "drop8"
  type: "Dropout"
  bottom: "conv81"
  top: "conv81"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "up9"
  type: "Deconvolution"
  bottom: "conv81"
  top: "up9"
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat9"
  type: "Concat"
  bottom: "up9"
  bottom: "conv11"
  top: "concat9"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv9"
  type: "Convolution"
  bottom: "concat9"
  top: "conv9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu9"
  type: "ReLU"
  bottom: "conv9"
  top: "conv9"
}

layer {
  name: "conv91"
  type: "Convolution"
  bottom: "conv9"
  top: "conv91"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu91"
  type: "ReLU"
  bottom: "conv91"
  top: "conv91"
}

layer {
  name: "drop9"
  type: "Dropout"
  bottom: "conv91"
  top: "conv91"
  dropout_param {
    dropout_ratio: 0.3
  }
}

layer {
  name: "conv10"
  type: "Convolution"
  bottom: "conv91"
  top: "conv10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "prob"
  type: "Sigmoid"
  bottom: "conv10"
  top: "prob"
}

layer {
  name: "label"
  type: "ImageData"
  top: "label"
  top: "nothing"
  transform_param {
    scale: 0.00392156862745
  }
  image_data_param {
    source: "data/mask.txt"
    batch_size: 32
    is_color: false
    shuffle: false
    new_height: 96
    new_width: 128
  }
}

layer {
  name: "silence"
  type: "Silence"
  bottom: "nothing"
  bottom: "aaa"
}

layer {
  name: "loss"
  type: "Python"
  top: "loss"
  bottom: "prob"
  bottom: "label"
  python_param {
    module: "perClassLoss"
    layer: "perClassLossLayer"
  }
  loss_weight: 1
}

