name: "unet"
layer {
  name: "label"
  type: "ImageData"
  top: "label"
  top: "nothing"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00392156862745
  }
  image_data_param {
    source: "data/val_mask.txt"
    batch_size: 24
    is_color: false
    shuffle: false
    new_height: 160
    new_width: 224
  }
}

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "aaa"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00392156862745
  }
  image_data_param {
    source: "data/val.txt"
    batch_size: 24
    is_color: false
    shuffle: false
    new_height: 160
    new_width: 224
  }
}

layer {
  name: "label"
  type: "ImageData"
  top: "label"
  top: "nothing"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00392156862745
  }
  image_data_param {
    source: "data/mask.txt"
    batch_size: 24
    is_color: false
    shuffle: false
    new_height: 160
    new_width: 224
  }
}

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "aaa"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00392156862745
  }
  image_data_param {
    source: "data/train.txt"
    batch_size: 24
    is_color: false
    shuffle: false
    new_height: 160
    new_width: 224
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "conv_1_1"
  type: "Convolution"
  bottom: "conv1"
  top: "conv_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_1_1"
  type: "ReLU"
  bottom: "conv_1_1"
  top: "conv_1_1"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv_1_1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "conv_2_1"
  type: "Convolution"
  bottom: "conv2"
  top: "conv_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_2_1"
  type: "ReLU"
  bottom: "conv_2_1"
  top: "conv_2_1"
}

layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv_2_1"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "conv_3_1"
  type: "Convolution"
  bottom: "conv3"
  top: "conv_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_3_1"
  type: "ReLU"
  bottom: "conv_3_1"
  top: "conv_3_1"
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv_3_1"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv4"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "conv_4_1"
  type: "Convolution"
  bottom: "conv4"
  top: "conv_4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_4_1"
  type: "ReLU"
  bottom: "conv_4_1"
  top: "conv_4_1"
}

layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv_4_1"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}

layer {
  name: "conv_5_1"
  type: "Convolution"
  bottom: "conv5"
  top: "conv_5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_5_1"
  type: "ReLU"
  bottom: "conv_5_1"
  top: "conv_5_1"
}

layer {
  name: "up6"
  type: "Deconvolution"
  bottom: "conv_5_1"
  top: "up6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 2
    stride: 2
    bias_filler {
      type: "constant"
    }
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "conv_6_0"
  type: "Convolution"
  bottom: "up6"
  top: "conv_6_0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat6"
  type: "Concat"
  bottom: "conv_6_0"
  bottom: "conv_4_1"
  top: "concat6"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv6"
  type: "Convolution"
  bottom: "concat6"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "conv6"
}

layer {
  name: "conv_6_1"
  type: "Convolution"
  bottom: "conv6"
  top: "conv_6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_6_1"
  type: "ReLU"
  bottom: "conv_6_1"
  top: "conv_6_1"
}

layer {
  name: "up7"
  type: "Deconvolution"
  bottom: "conv_6_1"
  top: "up7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 2
    stride: 2
    bias_filler {
      type: "constant"
    }
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "conv_7_0"
  type: "Convolution"
  bottom: "up7"
  top: "conv_7_0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat7"
  type: "Concat"
  bottom: "conv_7_0"
  bottom: "conv_3_1"
  top: "concat7"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv7"
  type: "Convolution"
  bottom: "concat7"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "conv7"
}

layer {
  name: "conv_7_1"
  type: "Convolution"
  bottom: "conv7"
  top: "conv_7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_7_1"
  type: "ReLU"
  bottom: "conv_7_1"
  top: "conv_7_1"
}

layer {
  name: "up8"
  type: "Deconvolution"
  bottom: "conv_7_1"
  top: "up8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 2
    stride: 2
    bias_filler {
      type: "constant"
    }
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "conv_8_0"
  type: "Convolution"
  bottom: "up8"
  top: "conv_8_0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat8"
  type: "Concat"
  bottom: "conv_8_0"
  bottom: "conv_2_1"
  top: "concat8"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv8"
  type: "Convolution"
  bottom: "concat8"
  top: "conv8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv8"
  top: "conv8"
}

layer {
  name: "conv_8_1"
  type: "Convolution"
  bottom: "conv8"
  top: "conv_8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_8_1"
  type: "ReLU"
  bottom: "conv_8_1"
  top: "conv_8_1"
}

layer {
  name: "up9"
  type: "Deconvolution"
  bottom: "conv_8_1"
  top: "up9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 2
    bias_filler {
      type: "constant"
    }
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "conv_9_0"
  type: "Convolution"
  bottom: "up9"
  top: "conv_9_0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "concat9"
  type: "Concat"
  bottom: "conv_9_0"
  bottom: "conv_1_1"
  top: "concat9"
  concat_param {
    axis: 1
  }
}

layer {
  name: "conv9"
  type: "Convolution"
  bottom: "concat9"
  top: "conv9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu9"
  type: "ReLU"
  bottom: "conv9"
  top: "conv9"
}

layer {
  name: "conv_9_1"
  type: "Convolution"
  bottom: "conv9"
  top: "conv_9_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "relu_9_1"
  type: "ReLU"
  bottom: "conv_9_1"
  top: "conv_9_1"
}

layer {
  name: "conv10"
  type: "Convolution"
  bottom: "conv_9_1"
  top: "conv10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
}

layer {
  name: "prob"
  type: "Sigmoid"
  bottom: "conv10"
  top: "prob"
}

layer {
  name: "silence"
  type: "Silence"
  bottom: "nothing"
}

layer {
  name: "loss"
  type: "Python"
  top: "loss"
  bottom: "prob"
  bottom: "label"
  python_param {
    module: "perClassLoss"
    layer: "perClassLossLayer"
  }
  loss_weight: 1
}

layer {
  name: "fc"
  type: "InnerProduct"
  bottom: "conv_5_1"
  top: "fc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "fc_relu"
  type: "ReLU"
  bottom: "fc"
  top: "fc"
}

layer {
  name: "fc_dropout"
  type: "Dropout"
  bottom: "fc"
  top: "fc"
  dropout_param {
    dropout_ratio: 0.5
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "fc"
  top: "fc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "softmaxwithloss"
  type: "SoftmaxWithLoss"
  bottom: "fc1"
  bottom: "aaa"
  top: "softmaxwithloss"
  loss_weight: 0.5
}

